# task 1
#
# Написати програму, яка вміє переводити температуру з C в Фаренгейти і Кельвіни.
# Наприклад: дана температура в Цельсіях 25 С
#
# Фаренгейт: 45.9F - вважається за формулою C * 9/5 + 32
#
# Кельвіни: 298.16K - вважається за формулою C + 273.15
#
# Користувач вводить температуру в градусах Цельсіях, програма выводить
# температуру в Фаренгейтах та Кельвінах
#
# У цьому завданні і в подальших буду використовувати тип float для більш точних обчислень.

# user_temp = float(input("Enter your temperature in C to convert: "))
#
# far_temp = user_temp * 9/5 + 32
# kelv_temp = user_temp + 273.15
#
# print(f"Find converted temperature: \n {far_temp}F \n {kelv_temp}K")

# Також для зручності можна округлити до 3х знаків після коми.

# print(f"Find converted temperature: \n {round(far_temp, 3)}F \n {round(kelv_temp, 3)}K")
